<!-- add-pr-comment:add-pr-comment -->

#### Terraform Plan 📖success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.external.sources_zip: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=2851a7b3aac1cb95d3336c40a60918b5b6ed706e]
module.daily_snapshot.data.external.sources_zip: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=d1d393e8359fba7aae9516a80c7f11716f358b28]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/3680578700191892692]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=346978865]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=983378cb-189e-437e-af3a-db65127cda4f]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-03-23T14:36:47Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "346978865" -> (known after apply)
      ~ ipv4_address         = "139.59.215.107" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.12" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-snapshot-calibnet"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          + "00:a0:c0:54:5f:40:22:10:52:8a:04:48:f9:c8:db:00",
          + "04:77:74:e8:81:92:9d:1e:cb:d3:5d:0d:fa:83:56:f6",
          + "09:b6:09:ef:ac:23:8a:94:df:3e:b9:9b:28:8d:c8:6f",
          + "31:fd:e9:da:70:df:ef:33:af:a2:ea:a1:fd:69:a7:9d",
          + "37:1e:1a:fc:25:2d:5a:a7:1f:49:b2:6d:53:5c:0e:45",
          + "41:91:6d:f9:f7:27:44:30:7f:a4:6f:36:e8:97:ad:cb",
          + "58:d8:c7:2a:ce:84:ca:41:10:06:93:35:34:6d:eb:a2",
          + "5f:d6:ad:06:b8:2d:4a:ef:0a:ac:97:bf:37:b0:7a:4c",
          + "68:35:f7:50:11:68:7b:df:9d:6a:49:83:eb:e9:37:20",
          + "77:09:d9:32:61:65:81:08:d1:e2:50:9b:ec:28:02:62",
          + "93:73:5f:22:81:11:ae:80:f0:63:0d:a7:09:4b:2d:2a",
          + "9c:18:88:44:c4:d6:74:84:07:9a:3c:9a:f6:17:f3:e4",
          + "9d:f6:f8:05:f7:c2:72:a2:b7:ce:f8:3e:71:12:2e:09",
          + "a1:82:1c:8d:82:65:91:0f:3b:ca:06:37:6f:e0:5a:11",
          + "a4:01:b5:d9:4c:3f:93:71:9b:02:83:66:5e:4f:62:25",
          + "c7:f9:b0:49:24:aa:30:36:4e:5f:d4:a3:ab:43:49:e8",
          + "cb:ca:60:61:a9:ba:e0:a0:ba:95:35:2d:48:f3:c2:05",
          + "d3:6d:af:8e:a4:b9:8f:b8:38:2b:56:06:5f:38:48:a7",
          + "e6:e2:79:dd:21:94:5c:50:32:b1:b2:89:c4:4c:5d:dd",
          + "f7:de:2d:83:ce:e7:c3:13:2c:ca:3a:f0:4b:4e:46:da",
          + "fa:f4:ba:d9:24:81:12:25:88:43:3a:f0:07:7c:af:6e",
          + "fe:42:94:20:d0:a9:24:67:5f:de:78:c1:bb:8b:6c:92",
            # (1 unchanged element hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:346978865" -> (known after apply)
      ~ user_data            = "cbf207292b705d92fb3335423901b9aa5a88db5a" -> "de2707eb1d7d5d7e995b7bcbad81208d8c5529a2" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 346978865,
        ] -> (known after apply)
        id              = "983378cb-189e-437e-af3a-db65127cda4f"
        name            = "forest-snapshot-calibnet"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:346978865",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "139.59.215.107",
        ],
      + [
          + null,
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>